zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_TENBASET_PHY.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K566_TENBASET_PHY.h
 * @version 2.2
 * @date 2025-10-16
 * @brief Peripheral Access Layer for S32K566_TENBASET_PHY
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K566_TENBASET_PHY_H_)  /* Check if memory map has not been already included */
#define S32K566_TENBASET_PHY_H_

#include "S32K566_COMMON.h"

/* ----------------------------------------------------------------------------
   -- TENBASET_PHY Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup TENBASET_PHY_Peripheral_Access_Layer TENBASET_PHY Peripheral Access Layer
 * @{
 */

/** TENBASET_PHY - Register Layout Typedef */
typedef struct TENBASET_PHY_Struct {
  __IO uint16_t PHYCTRL;                           /**< PHY control, offset: 0x0 */
  __I  uint16_t PHYSTAT;                           /**< PHY status, offset: 0x2 */
  __I  uint16_t PHYID0;                            /**< PHY Identifier0, offset: 0x4 */
  __I  uint16_t PHYID1;                            /**< PHY Identifier1, offset: 0x6 */
  uint8_t RESERVED_0[131100];
  __I  uint16_t BASE1EXT;                          /**< PHY BASE-T1 Extended, offset: 0x20024 */
  uint8_t RESERVED_1[4162];
  __I  uint16_t PMAPMDCTRL;                        /**< PMA/PMD Control, offset: 0x21068 */
  uint8_t RESERVED_2[392];
  __IO uint16_t PMACTRL;                           /**< PMA CTRL, offset: 0x211F2 */
  __I  uint16_t PMASTAT;                           /**< PMA Status, offset: 0x211F4 */
  __IO uint16_t PMATM;                             /**< PMA Test Mode, offset: 0x211F6 */
  uint8_t RESERVED_3[262126];
  __IO uint16_t PCSCTRL;                           /**< PCS Control, offset: 0x611E6 */
  __I  uint16_t PCSSTAT;                           /**< PCS Status, offset: 0x611E8 */
  __I  uint16_t PCSDIAG1;                          /**< PCS Remote Jabber Counter, offset: 0x611EA */
  __I  uint16_t PCSDIAG2;                          /**< PCS Physical Collisions Counter, offset: 0x611EC */
  uint8_t RESERVED_4[3611154];
  __IO uint16_t MODECTRL;                          /**< MODE Control, offset: 0x3D2C00 */
  __IO uint16_t MODECFG;                           /**< Mode Configuration, offset: 0x3D2C02 */
  __I  uint16_t MODESTAT;                          /**< Mode Status, offset: 0x3D2C04 */
  uint8_t RESERVED_5[26];
  __IO uint16_t WKCTRL;                            /**< Wake Control, offset: 0x3D2C20 */
  __IO uint16_t WKCFG;                             /**< Wake Configuration, offset: 0x3D2C22 */
  uint8_t RESERVED_6[2];
  __IO uint16_t WUPCTRL;                           /**< Wake Control, offset: 0x3D2C26 */
  __IO uint16_t WUPCFG;                            /**< Wakeup Confguration, offset: 0x3D2C28 */
  __I  uint16_t WUPSTAT;                           /**< Wakeup Status, offset: 0x3D2C2A */
  uint8_t RESERVED_7[20];
  __IO uint16_t SMIDATA;                           /**< SMI Frame DATA, offset: 0x3D2C40 */
  __IO uint16_t SMICTRL;                           /**< SMI Control, offset: 0x3D2C42 */
  __IO uint16_t SMICFG;                            /**< SMI Configuration, offset: 0x3D2C44 */
  __I  uint16_t SMISTAT;                           /**< SMI Status, offset: 0x3D2C46 */
  uint8_t RESERVED_8[24];
  __IO uint16_t INTENCAPT1;                        /**< Interrupt Capture1, offset: 0x3D2C60 */
  __IO uint16_t INTENSET1;                         /**< Interrupt Enable Set1, offset: 0x3D2C62 */
  __IO uint16_t INTENCLR1;                         /**< Interrupt Enable Clear1, offset: 0x3D2C64 */
  __I  uint16_t INTSTAT1;                          /**< Interrupt Status1, offset: 0x3D2C66 */
  uint8_t RESERVED_9[8];
  __IO uint16_t INTENCAPT2;                        /**< Interrupt Capture2, offset: 0x3D2C70 */
  __IO uint16_t INTENSET2;                         /**< Interrupt Enable Set1, offset: 0x3D2C72 */
  __IO uint16_t INTENCLR2;                         /**< Interrupt Enable Clear2, offset: 0x3D2C74 */
  __I  uint16_t INTSTAT2;                          /**< Interrupt Status2, offset: 0x3D2C76 */
  uint8_t RESERVED_10[42];
  __IO uint16_t PLCADIAG2;                         /**< PLCA NXP prop diagnostics, offset: 0x3D2CA2 */
  __IO uint16_t PLCADIAG3;                         /**< PLCA Beacon Counter Diagnostics, offset: 0x3D2CA4 */
  __IO uint16_t PLCADIAG4;                         /**< PLCA TO Counter Diagnostics, offset: 0x3D2CA6 */
  __IO uint16_t TXCDIAG;                           /**< Transceiver Diagnostics, offset: 0x3D2CA8 */
  uint8_t RESERVED_11[6];
  __IO uint16_t MSKPLCADIAG1;                      /**< Mask Control PLCADIAG1 Flag, offset: 0x3D2CB0 */
  __IO uint16_t MSKPLCADIAG2;                      /**< Mask Control PLCADIAG2 Flags, offset: 0x3D2CB2 */
  __IO uint16_t MSKTXCDIAG;                        /**< Mask Control TXCDIAG Flag, offset: 0x3D2CB4 */
  uint8_t RESERVED_12[42];
  __IO uint16_t ACCESSCTRL;                        /**< Global Access Control, offset: 0x3D2CE0 */
  __IO uint16_t DBGCTRL;                           /**< Debug Control, offset: 0x3D2CE2 */
  uint8_t RESERVED_13[26];
  __I  uint16_t VERSION;                           /**< Version Information, offset: 0x3D2CFE */
  uint8_t RESERVED_14[157440];
  __I  uint16_t PLCAIDVER;                         /**< PLCA Identification and Version, offset: 0x3F9400 */
  __IO uint16_t PLCACTRL0;                         /**< PLCA Control0, offset: 0x3F9402 */
  __IO uint16_t PLCACTRL1;                         /**< PLCA Control1, offset: 0x3F9404 */
  __I  uint16_t PLCASTAT;                          /**< PLCA Status, offset: 0x3F9406 */
  __IO uint16_t PLCATOTMR;                         /**< PLCA Transmit Opportunity Timer, offset: 0x3F9408 */
  __IO uint16_t PLCABURST;                         /**< PLCA Burst Mode Configuration, offset: 0x3F940A */
  __IO uint16_t PLCADIAG1;                         /**< PLCA TC14 Adv diagnostics, offset: 0x3F940C */
} TENBASET_PHY_Type, *TENBASET_PHY_MemMapPtr;

/** Number of instances of the TENBASET_PHY module. */
#define TENBASET_PHY_INSTANCE_COUNT              (4u)

