zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_TENBASET_PHY.h
/* TENBASET_PHY - Peripheral instance base addresses */
/** Peripheral TENBASET_PHY_0 base address */
#define IP_TENBASET_PHY_0_BASE                   (0x400B8000u)
/** Peripheral TENBASET_PHY_0 base pointer */
#define IP_TENBASET_PHY_0                        ((TENBASET_PHY_Type *)IP_TENBASET_PHY_0_BASE)
/** Peripheral TENBASET_PHY_1 base address */
#define IP_TENBASET_PHY_1_BASE                   (0x400BC000u)
/** Peripheral TENBASET_PHY_1 base pointer */
#define IP_TENBASET_PHY_1                        ((TENBASET_PHY_Type *)IP_TENBASET_PHY_1_BASE)
/** Peripheral TENBASET_PHY_2 base address */
#define IP_TENBASET_PHY_2_BASE                   (0x400C0000u)
/** Peripheral TENBASET_PHY_2 base pointer */
#define IP_TENBASET_PHY_2                        ((TENBASET_PHY_Type *)IP_TENBASET_PHY_2_BASE)
/** Peripheral TENBASET_PHY_3 base address */
#define IP_TENBASET_PHY_3_BASE                   (0x400C4000u)
/** Peripheral TENBASET_PHY_3 base pointer */
#define IP_TENBASET_PHY_3                        ((TENBASET_PHY_Type *)IP_TENBASET_PHY_3_BASE)
/** Array initializer of TENBASET_PHY peripheral base addresses */
#define IP_TENBASET_PHY_BASE_ADDRS               { IP_TENBASET_PHY_0_BASE, IP_TENBASET_PHY_1_BASE, IP_TENBASET_PHY_2_BASE, IP_TENBASET_PHY_3_BASE }
/** Array initializer of TENBASET_PHY peripheral base pointers */
#define IP_TENBASET_PHY_BASE_PTRS                { IP_TENBASET_PHY_0, IP_TENBASET_PHY_1, IP_TENBASET_PHY_2, IP_TENBASET_PHY_3 }

/* ----------------------------------------------------------------------------
   -- TENBASET_PHY Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup TENBASET_PHY_Register_Masks TENBASET_PHY Register Masks
 * @{
 */

/*! @name PHYCTRL - PHY control */
/*! @{ */

#define TENBASET_PHY_PHYCTRL_SPD1_MASK           (0x40U)
#define TENBASET_PHY_PHYCTRL_SPD1_SHIFT          (6U)
#define TENBASET_PHY_PHYCTRL_SPD1_WIDTH          (1U)
#define TENBASET_PHY_PHYCTRL_SPD1(x)             (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PHYCTRL_SPD1_SHIFT)) & TENBASET_PHY_PHYCTRL_SPD1_MASK)

#define TENBASET_PHY_PHYCTRL_CTEST_MASK          (0x80U)
#define TENBASET_PHY_PHYCTRL_CTEST_SHIFT         (7U)
#define TENBASET_PHY_PHYCTRL_CTEST_WIDTH         (1U)
#define TENBASET_PHY_PHYCTRL_CTEST(x)            (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PHYCTRL_CTEST_SHIFT)) & TENBASET_PHY_PHYCTRL_CTEST_MASK)

#define TENBASET_PHY_PHYCTRL_DUPLX_MASK          (0x100U)
#define TENBASET_PHY_PHYCTRL_DUPLX_SHIFT         (8U)
#define TENBASET_PHY_PHYCTRL_DUPLX_WIDTH         (1U)
#define TENBASET_PHY_PHYCTRL_DUPLX(x)            (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PHYCTRL_DUPLX_SHIFT)) & TENBASET_PHY_PHYCTRL_DUPLX_MASK)

#define TENBASET_PHY_PHYCTRL_SPD0_MASK           (0x2000U)
#define TENBASET_PHY_PHYCTRL_SPD0_SHIFT          (13U)
#define TENBASET_PHY_PHYCTRL_SPD0_WIDTH          (1U)
#define TENBASET_PHY_PHYCTRL_SPD0(x)             (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PHYCTRL_SPD0_SHIFT)) & TENBASET_PHY_PHYCTRL_SPD0_MASK)

#define TENBASET_PHY_PHYCTRL_RESET_MASK          (0x8000U)
#define TENBASET_PHY_PHYCTRL_RESET_SHIFT         (15U)
#define TENBASET_PHY_PHYCTRL_RESET_WIDTH         (1U)
#define TENBASET_PHY_PHYCTRL_RESET(x)            (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PHYCTRL_RESET_SHIFT)) & TENBASET_PHY_PHYCTRL_RESET_MASK)
/*! @} */

/*! @name PHYSTAT - PHY status */
/*! @{ */

#define TENBASET_PHY_PHYSTAT_LJAB_MASK           (0x2U)
#define TENBASET_PHY_PHYSTAT_LJAB_SHIFT          (1U)
#define TENBASET_PHY_PHYSTAT_LJAB_WIDTH          (1U)
#define TENBASET_PHY_PHYSTAT_LJAB(x)             (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PHYSTAT_LJAB_SHIFT)) & TENBASET_PHY_PHYSTAT_LJAB_MASK)

#define TENBASET_PHY_PHYSTAT_RJAB_MASK           (0x10U)
#define TENBASET_PHY_PHYSTAT_RJAB_SHIFT          (4U)
#define TENBASET_PHY_PHYSTAT_RJAB_WIDTH          (1U)
#define TENBASET_PHY_PHYSTAT_RJAB(x)             (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PHYSTAT_RJAB_SHIFT)) & TENBASET_PHY_PHYSTAT_RJAB_MASK)
/*! @} */

/*! @name PHYID0 - PHY Identifier0 */
/*! @{ */

#define TENBASET_PHY_PHYID0_OUI_03_18_MASK       (0xFFFFU)
#define TENBASET_PHY_PHYID0_OUI_03_18_SHIFT      (0U)
#define TENBASET_PHY_PHYID0_OUI_03_18_WIDTH      (16U)
#define TENBASET_PHY_PHYID0_OUI_03_18(x)         (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PHYID0_OUI_03_18_SHIFT)) & TENBASET_PHY_PHYID0_OUI_03_18_MASK)
/*! @} */

/*! @name PHYID1 - PHY Identifier1 */
/*! @{ */

#define TENBASET_PHY_PHYID1_ICREVISION_MASK      (0xFU)
#define TENBASET_PHY_PHYID1_ICREVISION_SHIFT     (0U)
#define TENBASET_PHY_PHYID1_ICREVISION_WIDTH     (4U)
#define TENBASET_PHY_PHYID1_ICREVISION(x)        (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PHYID1_ICREVISION_SHIFT)) & TENBASET_PHY_PHYID1_ICREVISION_MASK)

#define TENBASET_PHY_PHYID1_ICMODEL_MASK         (0x3F0U)
#define TENBASET_PHY_PHYID1_ICMODEL_SHIFT        (4U)
#define TENBASET_PHY_PHYID1_ICMODEL_WIDTH        (6U)
#define TENBASET_PHY_PHYID1_ICMODEL(x)           (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PHYID1_ICMODEL_SHIFT)) & TENBASET_PHY_PHYID1_ICMODEL_MASK)

#define TENBASET_PHY_PHYID1_OUI_19_24_MASK       (0xFC00U)
#define TENBASET_PHY_PHYID1_OUI_19_24_SHIFT      (10U)
#define TENBASET_PHY_PHYID1_OUI_19_24_WIDTH      (6U)
#define TENBASET_PHY_PHYID1_OUI_19_24(x)         (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PHYID1_OUI_19_24_SHIFT)) & TENBASET_PHY_PHYID1_OUI_19_24_MASK)
/*! @} */

/*! @name BASE1EXT - PHY BASE-T1 Extended */
/*! @{ */

#define TENBASET_PHY_BASE1EXT_BASET1EXT_BIT_MASK (0xFFFFU)
#define TENBASET_PHY_BASE1EXT_BASET1EXT_BIT_SHIFT (0U)
#define TENBASET_PHY_BASE1EXT_BASET1EXT_BIT_WIDTH (16U)
#define TENBASET_PHY_BASE1EXT_BASET1EXT_BIT(x)   (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_BASE1EXT_BASET1EXT_BIT_SHIFT)) & TENBASET_PHY_BASE1EXT_BASET1EXT_BIT_MASK)
/*! @} */

/*! @name PMAPMDCTRL - PMA/PMD Control */
/*! @{ */

#define TENBASET_PHY_PMAPMDCTRL_TYPE_MASK        (0xFU)
#define TENBASET_PHY_PMAPMDCTRL_TYPE_SHIFT       (0U)
#define TENBASET_PHY_PMAPMDCTRL_TYPE_WIDTH       (4U)
#define TENBASET_PHY_PMAPMDCTRL_TYPE(x)          (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PMAPMDCTRL_TYPE_SHIFT)) & TENBASET_PHY_PMAPMDCTRL_TYPE_MASK)
/*! @} */

/*! @name PMACTRL - PMA CTRL */
/*! @{ */

