zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_TENBASET_PHY.h
#define TENBASET_PHY_PMACTRL_LOOP_MASK           (0x1U)
#define TENBASET_PHY_PMACTRL_LOOP_SHIFT          (0U)
#define TENBASET_PHY_PMACTRL_LOOP_WIDTH          (1U)
#define TENBASET_PHY_PMACTRL_LOOP(x)             (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PMACTRL_LOOP_SHIFT)) & TENBASET_PHY_PMACTRL_LOOP_MASK)

#define TENBASET_PHY_PMACTRL_MULT_MASK           (0x400U)
#define TENBASET_PHY_PMACTRL_MULT_SHIFT          (10U)
#define TENBASET_PHY_PMACTRL_MULT_WIDTH          (1U)
#define TENBASET_PHY_PMACTRL_MULT(x)             (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PMACTRL_MULT_SHIFT)) & TENBASET_PHY_PMACTRL_MULT_MASK)

#define TENBASET_PHY_PMACTRL_TXDIS_MASK          (0x4000U)
#define TENBASET_PHY_PMACTRL_TXDIS_SHIFT         (14U)
#define TENBASET_PHY_PMACTRL_TXDIS_WIDTH         (1U)
#define TENBASET_PHY_PMACTRL_TXDIS(x)            (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PMACTRL_TXDIS_SHIFT)) & TENBASET_PHY_PMACTRL_TXDIS_MASK)

#define TENBASET_PHY_PMACTRL_RST_MASK            (0x8000U)
#define TENBASET_PHY_PMACTRL_RST_SHIFT           (15U)
#define TENBASET_PHY_PMACTRL_RST_WIDTH           (1U)
#define TENBASET_PHY_PMACTRL_RST(x)              (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PMACTRL_RST_SHIFT)) & TENBASET_PHY_PMACTRL_RST_MASK)
/*! @} */

/*! @name PMASTAT - PMA Status */
/*! @{ */

#define TENBASET_PHY_PMASTAT_RJAB_MASK           (0x2U)
#define TENBASET_PHY_PMASTAT_RJAB_SHIFT          (1U)
#define TENBASET_PHY_PMASTAT_RJAB_WIDTH          (1U)
#define TENBASET_PHY_PMASTAT_RJAB(x)             (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PMASTAT_RJAB_SHIFT)) & TENBASET_PHY_PMASTAT_RJAB_MASK)

#define TENBASET_PHY_PMASTAT_RFLTA_MASK          (0x200U)
#define TENBASET_PHY_PMASTAT_RFLTA_SHIFT         (9U)
#define TENBASET_PHY_PMASTAT_RFLTA_WIDTH         (1U)
#define TENBASET_PHY_PMASTAT_RFLTA(x)            (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PMASTAT_RFLTA_SHIFT)) & TENBASET_PHY_PMASTAT_RFLTA_MASK)

#define TENBASET_PHY_PMASTAT_MULTA_MASK          (0x400U)
#define TENBASET_PHY_PMASTAT_MULTA_SHIFT         (10U)
#define TENBASET_PHY_PMASTAT_MULTA_WIDTH         (1U)
#define TENBASET_PHY_PMASTAT_MULTA(x)            (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PMASTAT_MULTA_SHIFT)) & TENBASET_PHY_PMASTAT_MULTA_MASK)

#define TENBASET_PHY_PMASTAT_LPWA_MASK           (0x800U)
#define TENBASET_PHY_PMASTAT_LPWA_SHIFT          (11U)
#define TENBASET_PHY_PMASTAT_LPWA_WIDTH          (1U)
#define TENBASET_PHY_PMASTAT_LPWA(x)             (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PMASTAT_LPWA_SHIFT)) & TENBASET_PHY_PMASTAT_LPWA_MASK)

#define TENBASET_PHY_PMASTAT_LOOPA_MASK          (0x2000U)
#define TENBASET_PHY_PMASTAT_LOOPA_SHIFT         (13U)
#define TENBASET_PHY_PMASTAT_LOOPA_WIDTH         (1U)
#define TENBASET_PHY_PMASTAT_LOOPA(x)            (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PMASTAT_LOOPA_SHIFT)) & TENBASET_PHY_PMASTAT_LOOPA_MASK)
/*! @} */

/*! @name PMATM - PMA Test Mode */
/*! @{ */

#define TENBASET_PHY_PMATM_PATTERN_MASK          (0xE000U)
#define TENBASET_PHY_PMATM_PATTERN_SHIFT         (13U)
#define TENBASET_PHY_PMATM_PATTERN_WIDTH         (3U)
#define TENBASET_PHY_PMATM_PATTERN(x)            (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PMATM_PATTERN_SHIFT)) & TENBASET_PHY_PMATM_PATTERN_MASK)
/*! @} */

/*! @name PCSCTRL - PCS Control */
/*! @{ */

#define TENBASET_PHY_PCSCTRL_DUPLX_MASK          (0x100U)
#define TENBASET_PHY_PCSCTRL_DUPLX_SHIFT         (8U)
#define TENBASET_PHY_PCSCTRL_DUPLX_WIDTH         (1U)
#define TENBASET_PHY_PCSCTRL_DUPLX(x)            (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PCSCTRL_DUPLX_SHIFT)) & TENBASET_PHY_PCSCTRL_DUPLX_MASK)

#define TENBASET_PHY_PCSCTRL_LOOP_MASK           (0x4000U)
#define TENBASET_PHY_PCSCTRL_LOOP_SHIFT          (14U)
#define TENBASET_PHY_PCSCTRL_LOOP_WIDTH          (1U)
#define TENBASET_PHY_PCSCTRL_LOOP(x)             (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PCSCTRL_LOOP_SHIFT)) & TENBASET_PHY_PCSCTRL_LOOP_MASK)

#define TENBASET_PHY_PCSCTRL_RST_MASK            (0x8000U)
#define TENBASET_PHY_PCSCTRL_RST_SHIFT           (15U)
#define TENBASET_PHY_PCSCTRL_RST_WIDTH           (1U)
#define TENBASET_PHY_PCSCTRL_RST(x)              (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PCSCTRL_RST_SHIFT)) & TENBASET_PHY_PCSCTRL_RST_MASK)
/*! @} */

/*! @name PCSSTAT - PCS Status */
/*! @{ */

#define TENBASET_PHY_PCSSTAT_JAB_MASK            (0x80U)
#define TENBASET_PHY_PCSSTAT_JAB_SHIFT           (7U)
#define TENBASET_PHY_PCSSTAT_JAB_WIDTH           (1U)
#define TENBASET_PHY_PCSSTAT_JAB(x)              (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PCSSTAT_JAB_SHIFT)) & TENBASET_PHY_PCSSTAT_JAB_MASK)
/*! @} */

/*! @name PCSDIAG1 - PCS Remote Jabber Counter */
/*! @{ */

#define TENBASET_PHY_PCSDIAG1_REMJABCNT_MASK     (0xFFFFU)
#define TENBASET_PHY_PCSDIAG1_REMJABCNT_SHIFT    (0U)
#define TENBASET_PHY_PCSDIAG1_REMJABCNT_WIDTH    (16U)
#define TENBASET_PHY_PCSDIAG1_REMJABCNT(x)       (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PCSDIAG1_REMJABCNT_SHIFT)) & TENBASET_PHY_PCSDIAG1_REMJABCNT_MASK)
/*! @} */

/*! @name PCSDIAG2 - PCS Physical Collisions Counter */
/*! @{ */

#define TENBASET_PHY_PCSDIAG2_PHYCOLCNT_MASK     (0xFFFFU)
#define TENBASET_PHY_PCSDIAG2_PHYCOLCNT_SHIFT    (0U)
#define TENBASET_PHY_PCSDIAG2_PHYCOLCNT_WIDTH    (16U)
#define TENBASET_PHY_PCSDIAG2_PHYCOLCNT(x)       (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PCSDIAG2_PHYCOLCNT_SHIFT)) & TENBASET_PHY_PCSDIAG2_PHYCOLCNT_MASK)
/*! @} */

/*! @name MODECTRL - MODE Control */
/*! @{ */

#define TENBASET_PHY_MODECTRL_CMD_MASK           (0x7U)
#define TENBASET_PHY_MODECTRL_CMD_SHIFT          (0U)
#define TENBASET_PHY_MODECTRL_CMD_WIDTH          (3U)
#define TENBASET_PHY_MODECTRL_CMD(x)             (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_MODECTRL_CMD_SHIFT)) & TENBASET_PHY_MODECTRL_CMD_MASK)
/*! @} */

/*! @name MODECFG - Mode Configuration */
/*! @{ */

#define TENBASET_PHY_MODECFG_LCLWKENA_MASK       (0x1U)
#define TENBASET_PHY_MODECFG_LCLWKENA_SHIFT      (0U)
#define TENBASET_PHY_MODECFG_LCLWKENA_WIDTH      (1U)
#define TENBASET_PHY_MODECFG_LCLWKENA(x)         (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_MODECFG_LCLWKENA_SHIFT)) & TENBASET_PHY_MODECFG_LCLWKENA_MASK)

#define TENBASET_PHY_MODECFG_REMWKENA_MASK       (0x2U)
#define TENBASET_PHY_MODECFG_REMWKENA_SHIFT      (1U)
#define TENBASET_PHY_MODECFG_REMWKENA_WIDTH      (1U)
#define TENBASET_PHY_MODECFG_REMWKENA(x)         (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_MODECFG_REMWKENA_SHIFT)) & TENBASET_PHY_MODECFG_REMWKENA_MASK)

