zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_TENBASET_PHY.h
#define TENBASET_PHY_MODECFG_SSPWKENA_MASK       (0x4U)
#define TENBASET_PHY_MODECFG_SSPWKENA_SHIFT      (2U)
#define TENBASET_PHY_MODECFG_SSPWKENA_WIDTH      (1U)
#define TENBASET_PHY_MODECFG_SSPWKENA(x)         (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_MODECFG_SSPWKENA_SHIFT)) & TENBASET_PHY_MODECFG_SSPWKENA_MASK)
/*! @} */

/*! @name MODESTAT - Mode Status */
/*! @{ */

#define TENBASET_PHY_MODESTAT_STAT_MASK          (0xFU)
#define TENBASET_PHY_MODESTAT_STAT_SHIFT         (0U)
#define TENBASET_PHY_MODESTAT_STAT_WIDTH         (4U)
#define TENBASET_PHY_MODESTAT_STAT(x)            (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_MODESTAT_STAT_SHIFT)) & TENBASET_PHY_MODESTAT_STAT_MASK)

#define TENBASET_PHY_MODESTAT_SILENTTO_MASK      (0x10U)
#define TENBASET_PHY_MODESTAT_SILENTTO_SHIFT     (4U)
#define TENBASET_PHY_MODESTAT_SILENTTO_WIDTH     (1U)
#define TENBASET_PHY_MODESTAT_SILENTTO(x)        (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_MODESTAT_SILENTTO_SHIFT)) & TENBASET_PHY_MODESTAT_SILENTTO_MASK)
/*! @} */

/*! @name WKCTRL - Wake Control */
/*! @{ */

#define TENBASET_PHY_WKCTRL_REMWKFDW_MASK        (0x1U)
#define TENBASET_PHY_WKCTRL_REMWKFDW_SHIFT       (0U)
#define TENBASET_PHY_WKCTRL_REMWKFDW_WIDTH       (1U)
#define TENBASET_PHY_WKCTRL_REMWKFDW(x)          (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_WKCTRL_REMWKFDW_SHIFT)) & TENBASET_PHY_WKCTRL_REMWKFDW_MASK)
/*! @} */

/*! @name WKCFG - Wake Configuration */
/*! @{ */

#define TENBASET_PHY_WKCFG_REMKWKFDW_MASK        (0x1U)
#define TENBASET_PHY_WKCFG_REMKWKFDW_SHIFT       (0U)
#define TENBASET_PHY_WKCFG_REMKWKFDW_WIDTH       (1U)
#define TENBASET_PHY_WKCFG_REMKWKFDW(x)          (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_WKCFG_REMKWKFDW_SHIFT)) & TENBASET_PHY_WKCFG_REMKWKFDW_MASK)
/*! @} */

/*! @name WUPCTRL - Wake Control */
/*! @{ */

#define TENBASET_PHY_WUPCTRL_WUPCMD_MASK         (0x1U)
#define TENBASET_PHY_WUPCTRL_WUPCMD_SHIFT        (0U)
#define TENBASET_PHY_WUPCTRL_WUPCMD_WIDTH        (1U)
#define TENBASET_PHY_WUPCTRL_WUPCMD(x)           (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_WUPCTRL_WUPCMD_SHIFT)) & TENBASET_PHY_WUPCTRL_WUPCMD_MASK)

#define TENBASET_PHY_WUPCTRL_ABORTCMD_MASK       (0x2U)
#define TENBASET_PHY_WUPCTRL_ABORTCMD_SHIFT      (1U)
#define TENBASET_PHY_WUPCTRL_ABORTCMD_WIDTH      (1U)
#define TENBASET_PHY_WUPCTRL_ABORTCMD(x)         (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_WUPCTRL_ABORTCMD_SHIFT)) & TENBASET_PHY_WUPCTRL_ABORTCMD_MASK)
/*! @} */

/*! @name WUPCFG - Wakeup Confguration */
/*! @{ */

#define TENBASET_PHY_WUPCFG_LCLWKWUP_MASK        (0x1U)
#define TENBASET_PHY_WUPCFG_LCLWKWUP_SHIFT       (0U)
#define TENBASET_PHY_WUPCFG_LCLWKWUP_WIDTH       (1U)
#define TENBASET_PHY_WUPCFG_LCLWKWUP(x)          (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_WUPCFG_LCLWKWUP_SHIFT)) & TENBASET_PHY_WUPCFG_LCLWKWUP_MASK)

#define TENBASET_PHY_WUPCFG_WUPTIMEOUT_MASK      (0xFF00U)
#define TENBASET_PHY_WUPCFG_WUPTIMEOUT_SHIFT     (8U)
#define TENBASET_PHY_WUPCFG_WUPTIMEOUT_WIDTH     (8U)
#define TENBASET_PHY_WUPCFG_WUPTIMEOUT(x)        (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_WUPCFG_WUPTIMEOUT_SHIFT)) & TENBASET_PHY_WUPCFG_WUPTIMEOUT_MASK)
/*! @} */

/*! @name WUPSTAT - Wakeup Status */
/*! @{ */

#define TENBASET_PHY_WUPSTAT_STAT_MASK           (0x3U)
#define TENBASET_PHY_WUPSTAT_STAT_SHIFT          (0U)
#define TENBASET_PHY_WUPSTAT_STAT_WIDTH          (2U)
#define TENBASET_PHY_WUPSTAT_STAT(x)             (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_WUPSTAT_STAT_SHIFT)) & TENBASET_PHY_WUPSTAT_STAT_MASK)

#define TENBASET_PHY_WUPSTAT_ERRCODE_MASK        (0x1CU)
#define TENBASET_PHY_WUPSTAT_ERRCODE_SHIFT       (2U)
#define TENBASET_PHY_WUPSTAT_ERRCODE_WIDTH       (3U)
#define TENBASET_PHY_WUPSTAT_ERRCODE(x)          (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_WUPSTAT_ERRCODE_SHIFT)) & TENBASET_PHY_WUPSTAT_ERRCODE_MASK)
/*! @} */

/*! @name SMIDATA - SMI Frame DATA */
/*! @{ */

#define TENBASET_PHY_SMIDATA_DATA_MASK           (0xFFFFU)
#define TENBASET_PHY_SMIDATA_DATA_SHIFT          (0U)
#define TENBASET_PHY_SMIDATA_DATA_WIDTH          (16U)
#define TENBASET_PHY_SMIDATA_DATA(x)             (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_SMIDATA_DATA_SHIFT)) & TENBASET_PHY_SMIDATA_DATA_MASK)
/*! @} */

/*! @name SMICTRL - SMI Control */
/*! @{ */

#define TENBASET_PHY_SMICTRL_TA_MASK             (0x3U)
#define TENBASET_PHY_SMICTRL_TA_SHIFT            (0U)
#define TENBASET_PHY_SMICTRL_TA_WIDTH            (2U)
#define TENBASET_PHY_SMICTRL_TA(x)               (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_SMICTRL_TA_SHIFT)) & TENBASET_PHY_SMICTRL_TA_MASK)

#define TENBASET_PHY_SMICTRL_RA_MASK             (0x7CU)
#define TENBASET_PHY_SMICTRL_RA_SHIFT            (2U)
#define TENBASET_PHY_SMICTRL_RA_WIDTH            (5U)
#define TENBASET_PHY_SMICTRL_RA(x)               (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_SMICTRL_RA_SHIFT)) & TENBASET_PHY_SMICTRL_RA_MASK)

#define TENBASET_PHY_SMICTRL_PA_MASK             (0xF80U)
#define TENBASET_PHY_SMICTRL_PA_SHIFT            (7U)
#define TENBASET_PHY_SMICTRL_PA_WIDTH            (5U)
#define TENBASET_PHY_SMICTRL_PA(x)               (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_SMICTRL_PA_SHIFT)) & TENBASET_PHY_SMICTRL_PA_MASK)

#define TENBASET_PHY_SMICTRL_OP_MASK             (0x3000U)
#define TENBASET_PHY_SMICTRL_OP_SHIFT            (12U)
#define TENBASET_PHY_SMICTRL_OP_WIDTH            (2U)
#define TENBASET_PHY_SMICTRL_OP(x)               (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_SMICTRL_OP_SHIFT)) & TENBASET_PHY_SMICTRL_OP_MASK)

#define TENBASET_PHY_SMICTRL_ST_MASK             (0xC000U)
#define TENBASET_PHY_SMICTRL_ST_SHIFT            (14U)
#define TENBASET_PHY_SMICTRL_ST_WIDTH            (2U)
#define TENBASET_PHY_SMICTRL_ST(x)               (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_SMICTRL_ST_SHIFT)) & TENBASET_PHY_SMICTRL_ST_MASK)
/*! @} */

/*! @name SMICFG - SMI Configuration */
/*! @{ */

#define TENBASET_PHY_SMICFG_SPEED_MASK           (0x7EU)
#define TENBASET_PHY_SMICFG_SPEED_SHIFT          (1U)
#define TENBASET_PHY_SMICFG_SPEED_WIDTH          (6U)
#define TENBASET_PHY_SMICFG_SPEED(x)             (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_SMICFG_SPEED_SHIFT)) & TENBASET_PHY_SMICFG_SPEED_MASK)

#define TENBASET_PHY_SMICFG_DISPRE_MASK          (0x80U)
#define TENBASET_PHY_SMICFG_DISPRE_SHIFT         (7U)
#define TENBASET_PHY_SMICFG_DISPRE_WIDTH         (1U)
#define TENBASET_PHY_SMICFG_DISPRE(x)            (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_SMICFG_DISPRE_SHIFT)) & TENBASET_PHY_SMICFG_DISPRE_MASK)

