zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_TENBASET_PHY.h
#define TENBASET_PHY_INTENSET2_PINFAULT_MASK     (0x80U)
#define TENBASET_PHY_INTENSET2_PINFAULT_SHIFT    (7U)
#define TENBASET_PHY_INTENSET2_PINFAULT_WIDTH    (1U)
#define TENBASET_PHY_INTENSET2_PINFAULT(x)       (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENSET2_PINFAULT_SHIFT)) & TENBASET_PHY_INTENSET2_PINFAULT_MASK)

#define TENBASET_PHY_INTENSET2_PLCADIAG_MASK     (0x100U)
#define TENBASET_PHY_INTENSET2_PLCADIAG_SHIFT    (8U)
#define TENBASET_PHY_INTENSET2_PLCADIAG_WIDTH    (1U)
#define TENBASET_PHY_INTENSET2_PLCADIAG(x)       (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENSET2_PLCADIAG_SHIFT)) & TENBASET_PHY_INTENSET2_PLCADIAG_MASK)

#define TENBASET_PHY_INTENSET2_SMIACCESS_MASK    (0x200U)
#define TENBASET_PHY_INTENSET2_SMIACCESS_SHIFT   (9U)
#define TENBASET_PHY_INTENSET2_SMIACCESS_WIDTH   (1U)
#define TENBASET_PHY_INTENSET2_SMIACCESS(x)      (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENSET2_SMIACCESS_SHIFT)) & TENBASET_PHY_INTENSET2_SMIACCESS_MASK)

#define TENBASET_PHY_INTENSET2_LCLWK_MASK        (0x400U)
#define TENBASET_PHY_INTENSET2_LCLWK_SHIFT       (10U)
#define TENBASET_PHY_INTENSET2_LCLWK_WIDTH       (1U)
#define TENBASET_PHY_INTENSET2_LCLWK(x)          (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENSET2_LCLWK_SHIFT)) & TENBASET_PHY_INTENSET2_LCLWK_MASK)

#define TENBASET_PHY_INTENSET2_SSPDET_MASK       (0x800U)
#define TENBASET_PHY_INTENSET2_SSPDET_SHIFT      (11U)
#define TENBASET_PHY_INTENSET2_SSPDET_WIDTH      (1U)
#define TENBASET_PHY_INTENSET2_SSPDET(x)         (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENSET2_SSPDET_SHIFT)) & TENBASET_PHY_INTENSET2_SSPDET_MASK)

#define TENBASET_PHY_INTENSET2_WUTDET_MASK       (0x1000U)
#define TENBASET_PHY_INTENSET2_WUTDET_SHIFT      (12U)
#define TENBASET_PHY_INTENSET2_WUTDET_WIDTH      (1U)
#define TENBASET_PHY_INTENSET2_WUTDET(x)         (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENSET2_WUTDET_SHIFT)) & TENBASET_PHY_INTENSET2_WUTDET_MASK)

#define TENBASET_PHY_INTENSET2_WUPDONE_MASK      (0x2000U)
#define TENBASET_PHY_INTENSET2_WUPDONE_SHIFT     (13U)
#define TENBASET_PHY_INTENSET2_WUPDONE_WIDTH     (1U)
#define TENBASET_PHY_INTENSET2_WUPDONE(x)        (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENSET2_WUPDONE_SHIFT)) & TENBASET_PHY_INTENSET2_WUPDONE_MASK)

#define TENBASET_PHY_INTENSET2_APBPARITY_MASK    (0x4000U)
#define TENBASET_PHY_INTENSET2_APBPARITY_SHIFT   (14U)
#define TENBASET_PHY_INTENSET2_APBPARITY_WIDTH   (1U)
#define TENBASET_PHY_INTENSET2_APBPARITY(x)      (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENSET2_APBPARITY_SHIFT)) & TENBASET_PHY_INTENSET2_APBPARITY_MASK)
/*! @} */

/*! @name INTENCLR2 - Interrupt Enable Clear2 */
/*! @{ */

#define TENBASET_PHY_INTENCLR2_PHYSCOL_MASK      (0x1U)
#define TENBASET_PHY_INTENCLR2_PHYSCOL_SHIFT     (0U)
#define TENBASET_PHY_INTENCLR2_PHYSCOL_WIDTH     (1U)
#define TENBASET_PHY_INTENCLR2_PHYSCOL(x)        (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENCLR2_PHYSCOL_SHIFT)) & TENBASET_PHY_INTENCLR2_PHYSCOL_MASK)

#define TENBASET_PHY_INTENCLR2_PLCAREC_MASK      (0x2U)
#define TENBASET_PHY_INTENCLR2_PLCAREC_SHIFT     (1U)
#define TENBASET_PHY_INTENCLR2_PLCAREC_WIDTH     (1U)
#define TENBASET_PHY_INTENCLR2_PLCAREC(x)        (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENCLR2_PLCAREC_SHIFT)) & TENBASET_PHY_INTENCLR2_PLCAREC_MASK)

#define TENBASET_PHY_INTENCLR2_PLCASTAT_MASK     (0x4U)
#define TENBASET_PHY_INTENCLR2_PLCASTAT_SHIFT    (2U)
#define TENBASET_PHY_INTENCLR2_PLCASTAT_WIDTH    (1U)
#define TENBASET_PHY_INTENCLR2_PLCASTAT(x)       (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENCLR2_PLCASTAT_SHIFT)) & TENBASET_PHY_INTENCLR2_PLCASTAT_MASK)

#define TENBASET_PHY_INTENCLR2_MODESTAT_MASK     (0x8U)
#define TENBASET_PHY_INTENCLR2_MODESTAT_SHIFT    (3U)
#define TENBASET_PHY_INTENCLR2_MODESTAT_WIDTH    (1U)
#define TENBASET_PHY_INTENCLR2_MODESTAT(x)       (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENCLR2_MODESTAT_SHIFT)) & TENBASET_PHY_INTENCLR2_MODESTAT_MASK)

#define TENBASET_PHY_INTENCLR2_INVLDAPB_MASK     (0x10U)
#define TENBASET_PHY_INTENCLR2_INVLDAPB_SHIFT    (4U)
#define TENBASET_PHY_INTENCLR2_INVLDAPB_WIDTH    (1U)
#define TENBASET_PHY_INTENCLR2_INVLDAPB(x)       (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENCLR2_INVLDAPB_SHIFT)) & TENBASET_PHY_INTENCLR2_INVLDAPB_MASK)

#define TENBASET_PHY_INTENCLR2_LOCJAB_MASK       (0x20U)
#define TENBASET_PHY_INTENCLR2_LOCJAB_SHIFT      (5U)
#define TENBASET_PHY_INTENCLR2_LOCJAB_WIDTH      (1U)
#define TENBASET_PHY_INTENCLR2_LOCJAB(x)         (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENCLR2_LOCJAB_SHIFT)) & TENBASET_PHY_INTENCLR2_LOCJAB_MASK)

#define TENBASET_PHY_INTENCLR2_REMJAB_MASK       (0x40U)
#define TENBASET_PHY_INTENCLR2_REMJAB_SHIFT      (6U)
#define TENBASET_PHY_INTENCLR2_REMJAB_WIDTH      (1U)
#define TENBASET_PHY_INTENCLR2_REMJAB(x)         (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENCLR2_REMJAB_SHIFT)) & TENBASET_PHY_INTENCLR2_REMJAB_MASK)

#define TENBASET_PHY_INTENCLR2_PINFAULT_MASK     (0x80U)
#define TENBASET_PHY_INTENCLR2_PINFAULT_SHIFT    (7U)
#define TENBASET_PHY_INTENCLR2_PINFAULT_WIDTH    (1U)
#define TENBASET_PHY_INTENCLR2_PINFAULT(x)       (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENCLR2_PINFAULT_SHIFT)) & TENBASET_PHY_INTENCLR2_PINFAULT_MASK)

#define TENBASET_PHY_INTENCLR2_PLCADIAG_MASK     (0x100U)
#define TENBASET_PHY_INTENCLR2_PLCADIAG_SHIFT    (8U)
#define TENBASET_PHY_INTENCLR2_PLCADIAG_WIDTH    (1U)
#define TENBASET_PHY_INTENCLR2_PLCADIAG(x)       (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENCLR2_PLCADIAG_SHIFT)) & TENBASET_PHY_INTENCLR2_PLCADIAG_MASK)

#define TENBASET_PHY_INTENCLR2_SMIACCESS_MASK    (0x200U)
#define TENBASET_PHY_INTENCLR2_SMIACCESS_SHIFT   (9U)
#define TENBASET_PHY_INTENCLR2_SMIACCESS_WIDTH   (1U)
#define TENBASET_PHY_INTENCLR2_SMIACCESS(x)      (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENCLR2_SMIACCESS_SHIFT)) & TENBASET_PHY_INTENCLR2_SMIACCESS_MASK)

#define TENBASET_PHY_INTENCLR2_LCLWK_MASK        (0x400U)
#define TENBASET_PHY_INTENCLR2_LCLWK_SHIFT       (10U)
#define TENBASET_PHY_INTENCLR2_LCLWK_WIDTH       (1U)
#define TENBASET_PHY_INTENCLR2_LCLWK(x)          (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENCLR2_LCLWK_SHIFT)) & TENBASET_PHY_INTENCLR2_LCLWK_MASK)

#define TENBASET_PHY_INTENCLR2_SSPDET_MASK       (0x800U)
#define TENBASET_PHY_INTENCLR2_SSPDET_SHIFT      (11U)
#define TENBASET_PHY_INTENCLR2_SSPDET_WIDTH      (1U)
#define TENBASET_PHY_INTENCLR2_SSPDET(x)         (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENCLR2_SSPDET_SHIFT)) & TENBASET_PHY_INTENCLR2_SSPDET_MASK)

#define TENBASET_PHY_INTENCLR2_WUTDET_MASK       (0x1000U)
#define TENBASET_PHY_INTENCLR2_WUTDET_SHIFT      (12U)
#define TENBASET_PHY_INTENCLR2_WUTDET_WIDTH      (1U)
#define TENBASET_PHY_INTENCLR2_WUTDET(x)         (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENCLR2_WUTDET_SHIFT)) & TENBASET_PHY_INTENCLR2_WUTDET_MASK)

#define TENBASET_PHY_INTENCLR2_WUPDONE_MASK      (0x2000U)
#define TENBASET_PHY_INTENCLR2_WUPDONE_SHIFT     (13U)
#define TENBASET_PHY_INTENCLR2_WUPDONE_WIDTH     (1U)
#define TENBASET_PHY_INTENCLR2_WUPDONE(x)        (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENCLR2_WUPDONE_SHIFT)) & TENBASET_PHY_INTENCLR2_WUPDONE_MASK)

#define TENBASET_PHY_INTENCLR2_APBPARITY_MASK    (0x4000U)
#define TENBASET_PHY_INTENCLR2_APBPARITY_SHIFT   (14U)
#define TENBASET_PHY_INTENCLR2_APBPARITY_WIDTH   (1U)
#define TENBASET_PHY_INTENCLR2_APBPARITY(x)      (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTENCLR2_APBPARITY_SHIFT)) & TENBASET_PHY_INTENCLR2_APBPARITY_MASK)
/*! @} */

/*! @name INTSTAT2 - Interrupt Status2 */
/*! @{ */

#define TENBASET_PHY_INTSTAT2_PHYSCOL_MASK       (0x1U)
#define TENBASET_PHY_INTSTAT2_PHYSCOL_SHIFT      (0U)
#define TENBASET_PHY_INTSTAT2_PHYSCOL_WIDTH      (1U)
#define TENBASET_PHY_INTSTAT2_PHYSCOL(x)         (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_INTSTAT2_PHYSCOL_SHIFT)) & TENBASET_PHY_INTSTAT2_PHYSCOL_MASK)

