zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_TENBASET_PHY.h
#define TENBASET_PHY_TXCDIAG_LPWRFAIL_MASK       (0x10U)
#define TENBASET_PHY_TXCDIAG_LPWRFAIL_SHIFT      (4U)
#define TENBASET_PHY_TXCDIAG_LPWRFAIL_WIDTH      (1U)
#define TENBASET_PHY_TXCDIAG_LPWRFAIL(x)         (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_TXCDIAG_LPWRFAIL_SHIFT)) & TENBASET_PHY_TXCDIAG_LPWRFAIL_MASK)
/*! @} */

/*! @name MSKPLCADIAG1 - Mask Control PLCADIAG1 Flag */
/*! @{ */

#define TENBASET_PHY_MSKPLCADIAG1_BCNBFTO_MASK   (0x1U)
#define TENBASET_PHY_MSKPLCADIAG1_BCNBFTO_SHIFT  (0U)
#define TENBASET_PHY_MSKPLCADIAG1_BCNBFTO_WIDTH  (1U)
#define TENBASET_PHY_MSKPLCADIAG1_BCNBFTO(x)     (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_MSKPLCADIAG1_BCNBFTO_SHIFT)) & TENBASET_PHY_MSKPLCADIAG1_BCNBFTO_MASK)

#define TENBASET_PHY_MSKPLCADIAG1_UNEXPB_MASK    (0x2U)
#define TENBASET_PHY_MSKPLCADIAG1_UNEXPB_SHIFT   (1U)
#define TENBASET_PHY_MSKPLCADIAG1_UNEXPB_WIDTH   (1U)
#define TENBASET_PHY_MSKPLCADIAG1_UNEXPB(x)      (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_MSKPLCADIAG1_UNEXPB_SHIFT)) & TENBASET_PHY_MSKPLCADIAG1_UNEXPB_MASK)

#define TENBASET_PHY_MSKPLCADIAG1_RXINTO_MASK    (0x4U)
#define TENBASET_PHY_MSKPLCADIAG1_RXINTO_SHIFT   (2U)
#define TENBASET_PHY_MSKPLCADIAG1_RXINTO_WIDTH   (1U)
#define TENBASET_PHY_MSKPLCADIAG1_RXINTO(x)      (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_MSKPLCADIAG1_RXINTO_SHIFT)) & TENBASET_PHY_MSKPLCADIAG1_RXINTO_MASK)
/*! @} */

/*! @name MSKPLCADIAG2 - Mask Control PLCADIAG2 Flags */
/*! @{ */

#define TENBASET_PHY_MSKPLCADIAG2_EARLYBCN_MASK  (0x1U)
#define TENBASET_PHY_MSKPLCADIAG2_EARLYBCN_SHIFT (0U)
#define TENBASET_PHY_MSKPLCADIAG2_EARLYBCN_WIDTH (1U)
#define TENBASET_PHY_MSKPLCADIAG2_EARLYBCN(x)    (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_MSKPLCADIAG2_EARLYBCN_SHIFT)) & TENBASET_PHY_MSKPLCADIAG2_EARLYBCN_MASK)

#define TENBASET_PHY_MSKPLCADIAG2_LATEBCN_MASK   (0x2U)
#define TENBASET_PHY_MSKPLCADIAG2_LATEBCN_SHIFT  (1U)
#define TENBASET_PHY_MSKPLCADIAG2_LATEBCN_WIDTH  (1U)
#define TENBASET_PHY_MSKPLCADIAG2_LATEBCN(x)     (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_MSKPLCADIAG2_LATEBCN_SHIFT)) & TENBASET_PHY_MSKPLCADIAG2_LATEBCN_MASK)

#define TENBASET_PHY_MSKPLCADIAG2_NORXBCN_MASK   (0x4U)
#define TENBASET_PHY_MSKPLCADIAG2_NORXBCN_SHIFT  (2U)
#define TENBASET_PHY_MSKPLCADIAG2_NORXBCN_WIDTH  (1U)
#define TENBASET_PHY_MSKPLCADIAG2_NORXBCN(x)     (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_MSKPLCADIAG2_NORXBCN_SHIFT)) & TENBASET_PHY_MSKPLCADIAG2_NORXBCN_MASK)

#define TENBASET_PHY_MSKPLCADIAG2_UNDEFSTATE_MASK (0x8U)
#define TENBASET_PHY_MSKPLCADIAG2_UNDEFSTATE_SHIFT (3U)
#define TENBASET_PHY_MSKPLCADIAG2_UNDEFSTATE_WIDTH (1U)
#define TENBASET_PHY_MSKPLCADIAG2_UNDEFSTATE(x)  (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_MSKPLCADIAG2_UNDEFSTATE_SHIFT)) & TENBASET_PHY_MSKPLCADIAG2_UNDEFSTATE_MASK)
/*! @} */

/*! @name MSKTXCDIAG - Mask Control TXCDIAG Flag */
/*! @{ */

#define TENBASET_PHY_MSKTXCDIAG_RXLOWFAIL_MASK   (0x1U)
#define TENBASET_PHY_MSKTXCDIAG_RXLOWFAIL_SHIFT  (0U)
#define TENBASET_PHY_MSKTXCDIAG_RXLOWFAIL_WIDTH  (1U)
#define TENBASET_PHY_MSKTXCDIAG_RXLOWFAIL(x)     (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_MSKTXCDIAG_RXLOWFAIL_SHIFT)) & TENBASET_PHY_MSKTXCDIAG_RXLOWFAIL_MASK)

#define TENBASET_PHY_MSKTXCDIAG_RXHGHFAIL_MASK   (0x2U)
#define TENBASET_PHY_MSKTXCDIAG_RXHGHFAIL_SHIFT  (1U)
#define TENBASET_PHY_MSKTXCDIAG_RXHGHFAIL_WIDTH  (1U)
#define TENBASET_PHY_MSKTXCDIAG_RXHGHFAIL(x)     (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_MSKTXCDIAG_RXHGHFAIL_SHIFT)) & TENBASET_PHY_MSKTXCDIAG_RXHGHFAIL_MASK)

#define TENBASET_PHY_MSKTXCDIAG_EDLOWFAIL_MASK   (0x4U)
#define TENBASET_PHY_MSKTXCDIAG_EDLOWFAIL_SHIFT  (2U)
#define TENBASET_PHY_MSKTXCDIAG_EDLOWFAIL_WIDTH  (1U)
#define TENBASET_PHY_MSKTXCDIAG_EDLOWFAIL(x)     (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_MSKTXCDIAG_EDLOWFAIL_SHIFT)) & TENBASET_PHY_MSKTXCDIAG_EDLOWFAIL_MASK)

#define TENBASET_PHY_MSKTXCDIAG_EDHGHFAIL_MASK   (0x8U)
#define TENBASET_PHY_MSKTXCDIAG_EDHGHFAIL_SHIFT  (3U)
#define TENBASET_PHY_MSKTXCDIAG_EDHGHFAIL_WIDTH  (1U)
#define TENBASET_PHY_MSKTXCDIAG_EDHGHFAIL(x)     (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_MSKTXCDIAG_EDHGHFAIL_SHIFT)) & TENBASET_PHY_MSKTXCDIAG_EDHGHFAIL_MASK)

#define TENBASET_PHY_MSKTXCDIAG_LPWRFAIL_MASK    (0x10U)
#define TENBASET_PHY_MSKTXCDIAG_LPWRFAIL_SHIFT   (4U)
#define TENBASET_PHY_MSKTXCDIAG_LPWRFAIL_WIDTH   (1U)
#define TENBASET_PHY_MSKTXCDIAG_LPWRFAIL(x)      (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_MSKTXCDIAG_LPWRFAIL_SHIFT)) & TENBASET_PHY_MSKTXCDIAG_LPWRFAIL_MASK)
/*! @} */

/*! @name ACCESSCTRL - Global Access Control */
/*! @{ */

#define TENBASET_PHY_ACCESSCTRL_ACCESS_MASK      (0x1U)
#define TENBASET_PHY_ACCESSCTRL_ACCESS_SHIFT     (0U)
#define TENBASET_PHY_ACCESSCTRL_ACCESS_WIDTH     (1U)
#define TENBASET_PHY_ACCESSCTRL_ACCESS(x)        (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_ACCESSCTRL_ACCESS_SHIFT)) & TENBASET_PHY_ACCESSCTRL_ACCESS_MASK)
/*! @} */

/*! @name DBGCTRL - Debug Control */
/*! @{ */

#define TENBASET_PHY_DBGCTRL_DEBUG_MASK          (0xFFU)
#define TENBASET_PHY_DBGCTRL_DEBUG_SHIFT         (0U)
#define TENBASET_PHY_DBGCTRL_DEBUG_WIDTH         (8U)
#define TENBASET_PHY_DBGCTRL_DEBUG(x)            (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_DBGCTRL_DEBUG_SHIFT)) & TENBASET_PHY_DBGCTRL_DEBUG_MASK)
/*! @} */

/*! @name VERSION - Version Information */
/*! @{ */

#define TENBASET_PHY_VERSION_CUSTVER_MASK        (0xFU)
#define TENBASET_PHY_VERSION_CUSTVER_SHIFT       (0U)
#define TENBASET_PHY_VERSION_CUSTVER_WIDTH       (4U)
#define TENBASET_PHY_VERSION_CUSTVER(x)          (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_VERSION_CUSTVER_SHIFT)) & TENBASET_PHY_VERSION_CUSTVER_MASK)

#define TENBASET_PHY_VERSION_MINORVER_MASK       (0xFF0U)
#define TENBASET_PHY_VERSION_MINORVER_SHIFT      (4U)
#define TENBASET_PHY_VERSION_MINORVER_WIDTH      (8U)
#define TENBASET_PHY_VERSION_MINORVER(x)         (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_VERSION_MINORVER_SHIFT)) & TENBASET_PHY_VERSION_MINORVER_MASK)

#define TENBASET_PHY_VERSION_MAJORVER_MASK       (0xF000U)
#define TENBASET_PHY_VERSION_MAJORVER_SHIFT      (12U)
#define TENBASET_PHY_VERSION_MAJORVER_WIDTH      (4U)
#define TENBASET_PHY_VERSION_MAJORVER(x)         (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_VERSION_MAJORVER_SHIFT)) & TENBASET_PHY_VERSION_MAJORVER_MASK)
/*! @} */

