zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_TENBASET_PHY.h
/*! @name PLCAIDVER - PLCA Identification and Version */
/*! @{ */

#define TENBASET_PHY_PLCAIDVER_VER_MASK          (0xFFU)
#define TENBASET_PHY_PLCAIDVER_VER_SHIFT         (0U)
#define TENBASET_PHY_PLCAIDVER_VER_WIDTH         (8U)
#define TENBASET_PHY_PLCAIDVER_VER(x)            (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PLCAIDVER_VER_SHIFT)) & TENBASET_PHY_PLCAIDVER_VER_MASK)

#define TENBASET_PHY_PLCAIDVER_IDM_MASK          (0xFF00U)
#define TENBASET_PHY_PLCAIDVER_IDM_SHIFT         (8U)
#define TENBASET_PHY_PLCAIDVER_IDM_WIDTH         (8U)
#define TENBASET_PHY_PLCAIDVER_IDM(x)            (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PLCAIDVER_IDM_SHIFT)) & TENBASET_PHY_PLCAIDVER_IDM_MASK)
/*! @} */

/*! @name PLCACTRL0 - PLCA Control0 */
/*! @{ */

#define TENBASET_PHY_PLCACTRL0_RST_MASK          (0x4000U)
#define TENBASET_PHY_PLCACTRL0_RST_SHIFT         (14U)
#define TENBASET_PHY_PLCACTRL0_RST_WIDTH         (1U)
#define TENBASET_PHY_PLCACTRL0_RST(x)            (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PLCACTRL0_RST_SHIFT)) & TENBASET_PHY_PLCACTRL0_RST_MASK)

#define TENBASET_PHY_PLCACTRL0_EN_MASK           (0x8000U)
#define TENBASET_PHY_PLCACTRL0_EN_SHIFT          (15U)
#define TENBASET_PHY_PLCACTRL0_EN_WIDTH          (1U)
#define TENBASET_PHY_PLCACTRL0_EN(x)             (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PLCACTRL0_EN_SHIFT)) & TENBASET_PHY_PLCACTRL0_EN_MASK)
/*! @} */

/*! @name PLCACTRL1 - PLCA Control1 */
/*! @{ */

#define TENBASET_PHY_PLCACTRL1_ID_MASK           (0xFFU)
#define TENBASET_PHY_PLCACTRL1_ID_SHIFT          (0U)
#define TENBASET_PHY_PLCACTRL1_ID_WIDTH          (8U)
#define TENBASET_PHY_PLCACTRL1_ID(x)             (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PLCACTRL1_ID_SHIFT)) & TENBASET_PHY_PLCACTRL1_ID_MASK)

#define TENBASET_PHY_PLCACTRL1_NCNT_MASK         (0xFF00U)
#define TENBASET_PHY_PLCACTRL1_NCNT_SHIFT        (8U)
#define TENBASET_PHY_PLCACTRL1_NCNT_WIDTH        (8U)
#define TENBASET_PHY_PLCACTRL1_NCNT(x)           (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PLCACTRL1_NCNT_SHIFT)) & TENBASET_PHY_PLCACTRL1_NCNT_MASK)
/*! @} */

/*! @name PLCASTAT - PLCA Status */
/*! @{ */

#define TENBASET_PHY_PLCASTAT_PST_MASK           (0x8000U)
#define TENBASET_PHY_PLCASTAT_PST_SHIFT          (15U)
#define TENBASET_PHY_PLCASTAT_PST_WIDTH          (1U)
#define TENBASET_PHY_PLCASTAT_PST(x)             (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PLCASTAT_PST_SHIFT)) & TENBASET_PHY_PLCASTAT_PST_MASK)
/*! @} */

/*! @name PLCATOTMR - PLCA Transmit Opportunity Timer */
/*! @{ */

#define TENBASET_PHY_PLCATOTMR_TOTMR_MASK        (0xFFU)
#define TENBASET_PHY_PLCATOTMR_TOTMR_SHIFT       (0U)
#define TENBASET_PHY_PLCATOTMR_TOTMR_WIDTH       (8U)
#define TENBASET_PHY_PLCATOTMR_TOTMR(x)          (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PLCATOTMR_TOTMR_SHIFT)) & TENBASET_PHY_PLCATOTMR_TOTMR_MASK)
/*! @} */

/*! @name PLCABURST - PLCA Burst Mode Configuration */
/*! @{ */

#define TENBASET_PHY_PLCABURST_BTMR_MASK         (0xFFU)
#define TENBASET_PHY_PLCABURST_BTMR_SHIFT        (0U)
#define TENBASET_PHY_PLCABURST_BTMR_WIDTH        (8U)
#define TENBASET_PHY_PLCABURST_BTMR(x)           (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PLCABURST_BTMR_SHIFT)) & TENBASET_PHY_PLCABURST_BTMR_MASK)

#define TENBASET_PHY_PLCABURST_MAXBC_MASK        (0xFF00U)
#define TENBASET_PHY_PLCABURST_MAXBC_SHIFT       (8U)
#define TENBASET_PHY_PLCABURST_MAXBC_WIDTH       (8U)
#define TENBASET_PHY_PLCABURST_MAXBC(x)          (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PLCABURST_MAXBC_SHIFT)) & TENBASET_PHY_PLCABURST_MAXBC_MASK)
/*! @} */

/*! @name PLCADIAG1 - PLCA TC14 Adv diagnostics */
/*! @{ */

#define TENBASET_PHY_PLCADIAG1_BCNBFTO_MASK      (0x1U)
#define TENBASET_PHY_PLCADIAG1_BCNBFTO_SHIFT     (0U)
#define TENBASET_PHY_PLCADIAG1_BCNBFTO_WIDTH     (1U)
#define TENBASET_PHY_PLCADIAG1_BCNBFTO(x)        (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PLCADIAG1_BCNBFTO_SHIFT)) & TENBASET_PHY_PLCADIAG1_BCNBFTO_MASK)

#define TENBASET_PHY_PLCADIAG1_UNEXPB_MASK       (0x2U)
#define TENBASET_PHY_PLCADIAG1_UNEXPB_SHIFT      (1U)
#define TENBASET_PHY_PLCADIAG1_UNEXPB_WIDTH      (1U)
#define TENBASET_PHY_PLCADIAG1_UNEXPB(x)         (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PLCADIAG1_UNEXPB_SHIFT)) & TENBASET_PHY_PLCADIAG1_UNEXPB_MASK)

#define TENBASET_PHY_PLCADIAG1_RXINTO_MASK       (0x4U)
#define TENBASET_PHY_PLCADIAG1_RXINTO_SHIFT      (2U)
#define TENBASET_PHY_PLCADIAG1_RXINTO_WIDTH      (1U)
#define TENBASET_PHY_PLCADIAG1_RXINTO(x)         (((uint16_t)(((uint16_t)(x)) << TENBASET_PHY_PLCADIAG1_RXINTO_SHIFT)) & TENBASET_PHY_PLCADIAG1_RXINTO_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group TENBASET_PHY_Register_Masks */

/*!
 * @}
 */ /* end of group TENBASET_PHY_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K566_TENBASET_PHY_H_) */
